RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_dsp2_misc.c
/**
  ******************************************************************************
  * @file    bl808_dsp2_misc.c
  * @version V1.0
  * @date
  * @brief   This file is the standard driver c file
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

#include "bl808_dsp2_misc.h"

/** @addtogroup  BL808_Peripheral_Driver
 *  @{
 */

/** @addtogroup  DSP2_MISC
 *  @{
 */

/** @defgroup  DSP2_MISC_Private_Macros
 *  @{
 */

/*@} end of group DSP2_MISC_Private_Macros */

/** @defgroup  DSP2_MISC_Private_Types
 *  @{
 */

/*@} end of group DSP2_MISC_Private_Types */

/** @defgroup  DSP2_MISC_Private_Variables
 *  @{
 */
#ifndef BFLB_USE_HAL_DRIVER
static intCallback_Type *dsp2MiscIntCbfArra[DSP2_MISC_INT_ALL] = {
    NULL
};
#endif

/*@} end of group DSP2_MISC_Private_Variables */

/** @defgroup  DSP2_MISC_Global_Variables
 *  @{
 */

/*@} end of group DSP2_MISC_Global_Variables */

/** @defgroup  DSP2_MISC_Private_Fun_Declaration
 *  @{
 */

/*@} end of group DSP2_MISC_Private_Fun_Declaration */

/** @defgroup  DSP2_MISC_Private_Functions
 *  @{
 */

/*@} end of group DSP2_MISC_Private_Functions */

/** @defgroup  DSP2_MISC_Public_Functions
 *  @{
 */

/****************************************************************************//**
 * @brief  DVP AS 2X function init
 *
 * @param  dvp2xCfg: DVP AS 2X configuration structure pointer
 *
 * @return None
 *
*******************************************************************************/
void DSP2_MISC_2X_Init(DSP2_MISC_2X_Cfg_Type *dvp2xCfg)
{
    uint32_t tmpVal;

    /* Check the parameters */
    CHECK_PARAM(IS_DSP2_MISC_ACTIVE_LEVEL_TYPE(dvp2xCfg->hSyncLevel));
    CHECK_PARAM(IS_DSP2_MISC_ACTIVE_LEVEL_TYPE(dvp2xCfg->vSyncLevel));
    CHECK_PARAM(IS_DSP2_MISC_2X_DATA_ORDER_TYPE(dvp2xCfg->dataOrder));

    tmpVal = BL_RD_REG(DSP2_MISC_BASE, DSP2_MISC_CONFIG);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MISC_RG_DVPAS_HS_INV, dvp2xCfg->hSyncLevel);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MISC_RG_DVPAS_VS_INV, dvp2xCfg->vSyncLevel);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MISC_RG_DVPAS_DA_ORDER, dvp2xCfg->dataOrder);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MISC_RG_DVPAS_FIFO_TH, dvp2xCfg->fifoThreshold & 0x7ff);
    BL_WR_REG(DSP2_MISC_BASE, DSP2_MISC_CONFIG, tmpVal);
}

/****************************************************************************//**
 * @brief  DVP AS 2X function enable
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
void DSP2_MISC_2X_Enable(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(DSP2_MISC_BASE, DSP2_MISC_CONFIG);
    BL_WR_REG(DSP2_MISC_BASE, DSP2_MISC_CONFIG, BL_SET_REG_BIT(tmpVal, DSP2_MISC_RG_DVPAS_ENABLE));
}

/****************************************************************************//**
 * @brief  DVP AS 2X function disable
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
void DSP2_MISC_2X_Disable(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(DSP2_MISC_BASE, DSP2_MISC_CONFIG);
    BL_WR_REG(DSP2_MISC_BASE, DSP2_MISC_CONFIG, BL_CLR_REG_BIT(tmpVal, DSP2_MISC_RG_DVPAS_ENABLE));
}

/****************************************************************************/ /**
 * @brief  CAM input selection
 *
 * @param  camId: CAM id
 * @param  inputType: CAM input type
 *
 * @return None
 *
*******************************************************************************/
void DSP2_MISC_CAM_Input_Select(DSP2_MISC_CAM_ID_Type camId, DSP2_MISC_CAM_Input_Type inputType)
{
    uint32_t tmpVal;

    /* Check the parameters */
    CHECK_PARAM(IS_DSP2_MISC_CAM_ID_TYPE(camId));
    CHECK_PARAM(IS_DSP2_MISC_CAM_INPUT_TYPE(inputType));

    if (camId < DSP2_MISC_CAM_4_ID) {
        tmpVal = BL_RD_REG(DSP2_MISC_BASE, DSP2_MISC_DVP2BUS_SRC_SEL_1);
        tmpVal = (tmpVal & ~(0x3f << (camId * 8))) | (inputType & 0x3f) << (camId * 8);
        BL_WR_REG(DSP2_MISC_BASE, DSP2_MISC_DVP2BUS_SRC_SEL_1, tmpVal);
    } else {
        camId -= 4;
        tmpVal = BL_RD_REG(DSP2_MISC_BASE, DSP2_MISC_DVP2BUS_SRC_SEL_2);
        tmpVal = (tmpVal & ~(0x3f << (camId * 8))) | (inputType & 0x3f) << (camId * 8);
        BL_WR_REG(DSP2_MISC_BASE, DSP2_MISC_DVP2BUS_SRC_SEL_2, tmpVal);
    }
}

/****************************************************************************/ /**
 * @brief  CAM frame id type selection
 *
 * @param  camId: CAM id
 * @param  idType: Frame id type
 *
 * @return None
 *
*******************************************************************************/
void DSP2_MISC_CAM_Frame_ID_Select(DSP2_MISC_CAM_ID_Type camId, DSP2_MISC_Frame_ID_Type idType)
{
    uint32_t tmpVal;

    /* Check the parameters */
    CHECK_PARAM(IS_DSP2_MISC_CAM_ID_TYPE(camId));
    CHECK_PARAM(IS_DSP2_MISC_FRAME_ID_TYPE(idType));

