RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_dsp2_misc.c
    if (camId < DSP2_MISC_CAM_4_ID) {
        tmpVal = BL_RD_REG(DSP2_MISC_BASE, DSP2_MISC_DVP2BUS_SRC_SEL_1);
        tmpVal = (tmpVal & ~(0x1 << (camId * 8 + DSP2_MISC_RG_D2X_ID_SEL_A_POS))) | idType << (camId * 8 + DSP2_MISC_RG_D2X_ID_SEL_A_POS);
        BL_WR_REG(DSP2_MISC_BASE, DSP2_MISC_DVP2BUS_SRC_SEL_1, tmpVal);
    } else {
        camId -= 4;
        tmpVal = BL_RD_REG(DSP2_MISC_BASE, DSP2_MISC_DVP2BUS_SRC_SEL_2);
        tmpVal = (tmpVal & ~(0x1 << (camId * 8 + DSP2_MISC_RG_D2X_ID_SEL_E_POS))) | idType << (camId * 8 + DSP2_MISC_RG_D2X_ID_SEL_E_POS);
        BL_WR_REG(DSP2_MISC_BASE, DSP2_MISC_DVP2BUS_SRC_SEL_2, tmpVal);
    }
}

/****************************************************************************/ /**
 * @brief  Frame id init
 *
 * @param  idType: Frame id type
 * @param  edgeType: Frame id edge type
 * @param  vsyncCnt: Vsync count to trigger id increment
 *
 * @return None
 *
*******************************************************************************/
void DSP2_MISC_Frame_ID_Init(DSP2_MISC_Frame_ID_Type idType, DSP2_MISC_Frame_ID_Edge_Type edgeType, uint16_t vsyncCnt)
{
    uint32_t tmpVal;

    /* Check the parameters */
    CHECK_PARAM(IS_DSP2_MISC_FRAME_ID_TYPE(idType));
    CHECK_PARAM(IS_DSP2_MISC_FRAME_ID_EDGE_TYPE(edgeType));

    if (idType == DSP2_MISC_FRAME_BAYER_ID) {
        tmpVal = BL_RD_REG(DSP2_MISC_BASE, DSP2_MISC_DSP2_ID_BAYER);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MISC_REG_BAYER_IDGEN_EDGE, edgeType);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MISC_REG_BAYER_IDGEN_CNT_INCR, vsyncCnt);
        BL_WR_REG(DSP2_MISC_BASE, DSP2_MISC_DSP2_ID_BAYER, tmpVal);
    } else {
        tmpVal = BL_RD_REG(DSP2_MISC_BASE, DSP2_MISC_DSP2_ID_YUV);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MISC_REG_YUV_IDGEN_EDGE, edgeType);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MISC_REG_YUV_IDGEN_CNT_INCR, vsyncCnt);
        BL_WR_REG(DSP2_MISC_BASE, DSP2_MISC_DSP2_ID_YUV, tmpVal);
    }
}

/****************************************************************************/ /**
 * @brief  Reset frame id
 *
 * @param  idType: Frame id type
 *
 * @return None
 *
*******************************************************************************/
void DSP2_MISC_Frame_ID_Reset(DSP2_MISC_Frame_ID_Type idType)
{
    uint32_t tmpVal;

    /* Check the parameters */
    CHECK_PARAM(IS_DSP2_MISC_FRAME_ID_TYPE(idType));

    if (idType == DSP2_MISC_FRAME_BAYER_ID) {
        tmpVal = BL_RD_REG(DSP2_MISC_BASE, DSP2_MISC_DSP2_ID_BAYER);
        BL_WR_REG(DSP2_MISC_BASE, DSP2_MISC_DSP2_ID_BAYER, BL_SET_REG_BIT(tmpVal, DSP2_MISC_REG_BAYER_IDGEN_RST));
    } else {
        tmpVal = BL_RD_REG(DSP2_MISC_BASE, DSP2_MISC_DSP2_ID_YUV);
        BL_WR_REG(DSP2_MISC_BASE, DSP2_MISC_DSP2_ID_YUV, BL_SET_REG_BIT(tmpVal, DSP2_MISC_REG_YUV_IDGEN_RST));
    }
}

/****************************************************************************/ /**
 * @brief  OSD input selection
 *
 * @param  osdId: OSD id
 * @param  inputType: OSD input type
 *
 * @return None
 *
*******************************************************************************/
void DSP2_MISC_OSD_Input_Select(DSP2_MISC_OSD_ID_Type osdId, DSP2_MISC_OSD_Input_Type inputType)
{
    uint32_t tmpVal;
    uint32_t osdAddr = DSP2_MISC_BASE + DSP2_MISC_OSDA_I_CTRL_OFFSET + 4 * osdId;

    /* Check the parameters */
    CHECK_PARAM(IS_DSP2_MISC_OSD_ID_TYPE(osdId));
    CHECK_PARAM(IS_DSP2_MISC_OSD_INPUT_TYPE(inputType));

    tmpVal = BL_RD_WORD(osdAddr);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MISC_RG_OSDA_SEL, inputType);
    BL_WR_WORD(osdAddr, tmpVal);
}

/****************************************************************************/ /**
 * @brief  OSD probe input selection
 *
 * @param  inputType: OSD input type
 *
 * @return None
 *
*******************************************************************************/
void DSP2_MISC_OSD_Probe_Input_Select(DSP2_MISC_OSD_Input_Type inputType)
{
    uint32_t tmpVal;

    /* Check the parameters */
    CHECK_PARAM(IS_DSP2_MISC_OSD_INPUT_TYPE(inputType));

    if (inputType > DSP2_MISC_OSD_DSP2_INPUT) {
        return;
    }

    tmpVal = BL_RD_REG(DSP2_MISC_BASE, DSP2_MISC_OSDA_I_CTRL);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MISC_RG_OSD_PB_SEL, inputType);
    BL_WR_REG(DSP2_MISC_BASE, DSP2_MISC_OSDA_I_CTRL, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Crop init
 *
 * @param  cropId: Crop id
 * @param  cropCfg: Crop configuration structure pointer
 *
 * @return None
 *
*******************************************************************************/
void DSP2_MISC_Crop_Init(DSP2_MISC_Crop_ID_Type cropId, DSP2_MISC_Crop_Cfg_Type *cropCfg)
{
    uint32_t cropAddr = DSP2_MISC_BASE + DSP2_MISC_CROPA_HSYNC_OFFSET + 8 * cropId;

    /* Check the parameters */
    CHECK_PARAM(IS_DSP2_MISC_CROP_ID_TYPE(cropId));

    BL_WR_WORD(cropAddr, cropCfg->hsyncEnd << 16 | cropCfg->hsyncStart);
    cropAddr += 4;
    BL_WR_WORD(cropAddr, cropCfg->vsyncEnd << 16 | cropCfg->vsyncStart);
}

/****************************************************************************/ /**
 * @brief  Crop enable
 *
 * @param  cropId: Crop id
 *
 * @return None
 *
*******************************************************************************/
void DSP2_MISC_Crop_Enable(DSP2_MISC_Crop_ID_Type cropId)
{
    uint32_t tmpVal;

    /* Check the parameters */
    CHECK_PARAM(IS_DSP2_MISC_CROP_ID_TYPE(cropId));

    tmpVal = BL_RD_REG(DSP2_MISC_BASE, DSP2_MISC_CROP_ENABLE);

    switch (cropId) {
        case DSP2_MISC_CROP_0_ID:
            tmpVal = BL_SET_REG_BIT(tmpVal, DSP2_MISC_REG_CROPA_ENABLE);
            break;

        case DSP2_MISC_CROP_1_ID:
            tmpVal = BL_SET_REG_BIT(tmpVal, DSP2_MISC_REG_CROPB_ENABLE);
            break;

        case DSP2_MISC_CROP_2_ID:
            tmpVal = BL_SET_REG_BIT(tmpVal, DSP2_MISC_REG_CROPC_ENABLE);
            break;

        case DSP2_MISC_CROP_3_ID:
            tmpVal = BL_SET_REG_BIT(tmpVal, DSP2_MISC_REG_CROPD_ENABLE);
            break;

        default:
            break;
    }

    BL_WR_REG(DSP2_MISC_BASE, DSP2_MISC_CROP_ENABLE, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Crop disable
 *
 * @param  cropId: Crop id
 *
 * @return None
 *
*******************************************************************************/
void DSP2_MISC_Crop_Disable(DSP2_MISC_Crop_ID_Type cropId)
{
    uint32_t tmpVal;

    /* Check the parameters */
    CHECK_PARAM(IS_DSP2_MISC_CROP_ID_TYPE(cropId));

    tmpVal = BL_RD_REG(DSP2_MISC_BASE, DSP2_MISC_CROP_ENABLE);

    switch (cropId) {
        case DSP2_MISC_CROP_0_ID:
            tmpVal = BL_CLR_REG_BIT(tmpVal, DSP2_MISC_REG_CROPA_ENABLE);
            break;

        case DSP2_MISC_CROP_1_ID:
            tmpVal = BL_CLR_REG_BIT(tmpVal, DSP2_MISC_REG_CROPB_ENABLE);
            break;

        case DSP2_MISC_CROP_2_ID:
            tmpVal = BL_CLR_REG_BIT(tmpVal, DSP2_MISC_REG_CROPC_ENABLE);
            break;

        case DSP2_MISC_CROP_3_ID:
            tmpVal = BL_CLR_REG_BIT(tmpVal, DSP2_MISC_REG_CROPD_ENABLE);
            break;

        default:
            break;
    }

    BL_WR_REG(DSP2_MISC_BASE, DSP2_MISC_CROP_ENABLE, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Scaler input selection
 *
 * @param  scalerId: Scaler id
 * @param  inputType: Scaler input type
 *
 * @return None
 *
*******************************************************************************/
void DSP2_MISC_Scaler_Input_Select(DSP2_MISC_Scaler_ID_Type scalerId, DSP2_MISC_Scaler_Input_Type inputType)
{
    uint32_t tmpVal;
    uint32_t scalerAddr = DSP2_MISC_BASE + DSP2_MISC_SCALERA_I_SIZE_OFFSET + 8 * scalerId;

    /* Check the parameters */
    CHECK_PARAM(IS_DSP2_MISC_SCALER_ID_TYPE(scalerId));
    CHECK_PARAM(IS_DSP2_MISC_SCALER_INPUT_TYPE(inputType));

