RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_dsp2_misc.c
    tmpVal = BL_RD_WORD(scalerAddr);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MISC_RG_SCALERA_SEL, inputType);
    BL_WR_WORD(scalerAddr, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Scaler init
 *
 * @param  scalerId: Scaler id
 * @param  scalerCfg: Scaler configuration structure pointer
 *
 * @return None
 *
*******************************************************************************/
void DSP2_MISC_Scaler_Init(DSP2_MISC_Scaler_ID_Type scalerId, DSP2_MISC_Scaler_Cfg_Type *scalerCfg)
{
    uint32_t tmpVal;
    uint32_t scalerAddr = DSP2_MISC_BASE + DSP2_MISC_SCALERA_I_SIZE_OFFSET + 8 * scalerId;

    /* Check the parameters */
    CHECK_PARAM(IS_DSP2_MISC_SCALER_ID_TYPE(scalerId));

    tmpVal = BL_RD_WORD(scalerAddr);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MISC_RG_SCALERA_I_W, scalerCfg->inputWidth);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MISC_RG_SCALERA_I_H, scalerCfg->inputHeight & 0x7ff);
    BL_WR_WORD(scalerAddr, tmpVal);

    scalerAddr += 4;
    tmpVal = BL_RD_WORD(scalerAddr);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MISC_RG_SCALERA_O_W, scalerCfg->outputWidth);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MISC_RG_SCALERA_O_H, scalerCfg->outputHeight);
    BL_WR_WORD(scalerAddr, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Scaler enable
 *
 * @param  scalerId: Scaler id
 *
 * @return None
 *
*******************************************************************************/
void DSP2_MISC_Scaler_Enable(DSP2_MISC_Scaler_ID_Type scalerId)
{
    uint32_t tmpVal;
    uint32_t scalerAddr = DSP2_MISC_BASE + DSP2_MISC_SCALERA_I_SIZE_OFFSET + 8 * scalerId;

    /* Check the parameters */
    CHECK_PARAM(IS_DSP2_MISC_SCALER_ID_TYPE(scalerId));

    tmpVal = BL_RD_WORD(scalerAddr);
    tmpVal = BL_CLR_REG_BIT(tmpVal, DSP2_MISC_RG_SCALERA_BYPASS);
    BL_WR_WORD(scalerAddr, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Scaler disable
 *
 * @param  scalerId: Scaler id
 *
 * @return None
 *
*******************************************************************************/
void DSP2_MISC_Scaler_Disable(DSP2_MISC_Scaler_ID_Type scalerId)
{
    uint32_t tmpVal;
    uint32_t scalerAddr = DSP2_MISC_BASE + DSP2_MISC_SCALERA_I_SIZE_OFFSET + 8 * scalerId;

    /* Check the parameters */
    CHECK_PARAM(IS_DSP2_MISC_SCALER_ID_TYPE(scalerId));

    tmpVal = BL_RD_WORD(scalerAddr);
    tmpVal = BL_SET_REG_BIT(tmpVal, DSP2_MISC_RG_SCALERA_BYPASS);
    BL_WR_WORD(scalerAddr, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Adjust input selection
 *
 * @param  adjustId: Adjust id
 * @param  inputType: Adjust input type
 *
 * @return None
 *
*******************************************************************************/
void DSP2_MISC_Scaler_Shadow(DSP2_MISC_Scaler_ID_Type scalerId)
{
    uint32_t tmpVal;
    uint32_t scalerAddr = DSP2_MISC_BASE + DSP2_MISC_SCALERA_I_SIZE_OFFSET + 8 * scalerId;

    /* Check the parameters */
    CHECK_PARAM(IS_DSP2_MISC_SCALER_ID_TYPE(scalerId));

    tmpVal = BL_RD_WORD(scalerAddr);
    BL_WR_WORD(scalerAddr, BL_SET_REG_BIT(tmpVal, DSP2_MISC_RG_SCLRA_SW_SH));
}

/****************************************************************************/ /**
 * @brief  Adjust input selection
 *
 * @param  adjustId: Adjust id
 * @param  inputType: Adjust input type
 *
 * @return None
 *
*******************************************************************************/
void DSP2_MISC_Adjust_Input_Select(DSP2_MISC_Adjust_ID_Type adjustId, DSP2_MISC_Adjust_Input_Type inputType)
{
    uint32_t tmpVal;
    uint32_t adjustAddr = DSP2_MISC_BASE + DSP2_MISC_ADJA_CTRL_2_OFFSET + 16 * adjustId;

    /* Check the parameters */
    CHECK_PARAM(IS_DSP2_MISC_ADJUST_ID_TYPE(adjustId));
    CHECK_PARAM(IS_DSP2_MISC_ADJUST_INPUT_TYPE(inputType));

    tmpVal = BL_RD_WORD(adjustAddr);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MISC_RG_ADJA_SEL, inputType);
    BL_WR_WORD(adjustAddr, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Adjust init
 *
 * @param  adjustId: Adjust id
 * @param  adjustCfg: Adjust configuration structure pointer
 *
 * @return None
 *
*******************************************************************************/
void DSP2_MISC_Adjust_Init(DSP2_MISC_Adjust_ID_Type adjustId, DSP2_MISC_Adjust_Cfg_Type *adjustCfg)
{
    uint32_t tmpVal;
    uint32_t adjustAddr = DSP2_MISC_BASE + DSP2_MISC_ADJA_CTRL_0_OFFSET + 16 * adjustId;

    /* Check the parameters */
    CHECK_PARAM(IS_DSP2_MISC_ADJUST_ID_TYPE(adjustId));

    tmpVal = BL_RD_WORD(adjustAddr);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MISC_REG_ADJA_Y_LUMA, adjustCfg->yLuma);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MISC_REG_ADJA_Y_MUL0, adjustCfg->yMul0);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MISC_REG_ADJA_Y_MUL1, adjustCfg->yMul1);
    BL_WR_WORD(adjustAddr, tmpVal);

    adjustAddr += 4;
    tmpVal = BL_RD_WORD(adjustAddr);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MISC_REG_ADJA_Y_MIN, adjustCfg->yMin);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MISC_REG_ADJA_Y_MAX, adjustCfg->yMax);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MISC_REG_ADJA_UV_MIN, adjustCfg->uvMin);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MISC_REG_ADJA_UV_MAX, adjustCfg->uvMax);
    BL_WR_WORD(adjustAddr, tmpVal);

    adjustAddr += 4;
    tmpVal = BL_RD_WORD(adjustAddr);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MISC_REG_ADJA_UV_MUL0, adjustCfg->uvMul0);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MISC_REG_ADJA_UV_MUL1, adjustCfg->uvMul1);
    BL_WR_WORD(adjustAddr, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Adjust enable
 *
 * @param  adjustId: Adjust id
 *
 * @return None
 *
*******************************************************************************/
void DSP2_MISC_Adjust_Enable(DSP2_MISC_Adjust_ID_Type adjustId)
{
    uint32_t tmpVal;
    uint32_t adjustAddr = DSP2_MISC_BASE + DSP2_MISC_ADJA_CTRL_0_OFFSET + 16 * adjustId;

    /* Check the parameters */
    CHECK_PARAM(IS_DSP2_MISC_ADJUST_ID_TYPE(adjustId));

    tmpVal = BL_RD_WORD(adjustAddr);
    tmpVal = BL_SET_REG_BIT(tmpVal, DSP2_MISC_REG_ADJA_ADJ_EB);
    BL_WR_WORD(adjustAddr, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Adjust disable
 *
 * @param  adjustId: Adjust id
 *
 * @return None
 *
*******************************************************************************/
void DSP2_MISC_Adjust_Disable(DSP2_MISC_Adjust_ID_Type adjustId)
{
    uint32_t tmpVal;
    uint32_t adjustAddr = DSP2_MISC_BASE + DSP2_MISC_ADJA_CTRL_0_OFFSET + 16 * adjustId;

    /* Check the parameters */
    CHECK_PARAM(IS_DSP2_MISC_ADJUST_ID_TYPE(adjustId));

    tmpVal = BL_RD_WORD(adjustAddr);
    tmpVal = BL_CLR_REG_BIT(tmpVal, DSP2_MISC_REG_ADJA_ADJ_EB);
    BL_WR_WORD(adjustAddr, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Display init
 *
 * @param  displayCfg: Display configuration structure pointer
 *
 * @return None
 *
*******************************************************************************/
void DSP2_MISC_Display_Init(DSP2_MISC_Display_Cfg_Type *displayCfg)
{
    uint32_t tmpVal;

    /* Check the parameters */
    CHECK_PARAM(IS_DSP2_MISC_ADJUST_ID_TYPE(adjustId));
    CHECK_PARAM(IS_DSP2_MISC_DISPLAY_OSD_INPUT_TYPE(displayCfg->osdType));
    CHECK_PARAM(IS_DSP2_MISC_DISPLAY_INPUT_TYPE(displayCfg->inputType));

    tmpVal = BL_RD_REG(DSP2_MISC_BASE, DSP2_MISC_DISP_CONFIG);
    tmpVal = BL_CLR_REG_BIT(tmpVal, DSP2_MISC_RG_DISP_HDMI_EN);
    tmpVal = BL_CLR_REG_BIT(tmpVal, DSP2_MISC_RG_DISP_BT1120_EN);
    tmpVal = BL_CLR_REG_BIT(tmpVal, DSP2_MISC_RG_DISP_DPI_EN);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MISC_RG_DISP_MUX_SEL, displayCfg->inputType);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MISC_RG_OSDDP_SEL, displayCfg->osdType);
    BL_WR_REG(DSP2_MISC_BASE, DSP2_MISC_DISP_CONFIG, tmpVal);

    if (displayCfg->dpiEnable) {
        tmpVal = BL_SET_REG_BIT(tmpVal, DSP2_MISC_RG_DISP_DPI_EN);
    } else if (displayCfg->hdmiEnable) {
        tmpVal = BL_SET_REG_BIT(tmpVal, DSP2_MISC_RG_DISP_HDMI_EN);
    } else if (displayCfg->bt1120Enable) {
        tmpVal = BL_SET_REG_BIT(tmpVal, DSP2_MISC_RG_DISP_BT1120_EN);
    }

    BL_WR_REG(DSP2_MISC_BASE, DSP2_MISC_DISP_CONFIG, tmpVal);

    tmpVal = BL_RD_REG(DSP2_MISC_BASE, DSP2_MISC_DISP_DPI_CONFIG);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MISC_RG_DISP_DPI_HS_W, displayCfg->hsyncWidth);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MISC_RG_DISP_DPI_HFP_W, displayCfg->hfpWidth);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MISC_RG_DISP_DPI_VS_W, displayCfg->vsyncWidth);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MISC_RG_DISP_DPI_VFP_W, displayCfg->vfpWidth);
    BL_WR_REG(DSP2_MISC_BASE, DSP2_MISC_DISP_DPI_CONFIG, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Display gamma init
 *
 * @param  gammaCfg: Display gamma configuration structure pointer
 *
 * @return None
 *
*******************************************************************************/
void DSP2_MISC_Display_Gamma_Init(DSP2_MISC_Display_Gamma_Cfg_Type *gammaCfg)
{
    uint32_t tmpVal, i, j;

