RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_dsp2_misc.c
        case DSP2_MISC_INT_AWB1:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MISC_RG_AWB2_INT_MASK, intMask);
            break;

        case DSP2_MISC_INT_OSD_PB:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MISC_RG_OSD_PB_INT_MASK, intMask);
            break;

        case DSP2_MISC_INT_SEOF0:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MISC_RG_SEOF1_INT_MASK, intMask);
            break;

        case DSP2_MISC_INT_SEOF1:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MISC_RG_SEOF2_INT_MASK, intMask);
            break;

        case DSP2_MISC_INT_SEOF2:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MISC_RG_SEOF3_INT_MASK, intMask);
            break;

        case DSP2_MISC_INT_AE_HIST:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MISC_RG_AE_HIST_INT_MASK, intMask);
            break;

        case DSP2_MISC_INT_AWB2:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MISC_RG_AWB3_INT_MASK, intMask);
            break;

        case DSP2_MISC_INT_DISPLAY:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MISC_RG_DP_SEOF0_INT_MASK, intMask);
            break;

        case DSP2_MISC_INT_SEOF3:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MISC_RG_SEOF4_INT_MASK, intMask);
            break;

        case DSP2_MISC_INT_ALL:
            if (intMask == MASK) {
                tmpVal |= 0x1131111f;
            } else {
                tmpVal &= ~0x1131111f;
            }

            break;

        default:
            break;
    }

    BL_WR_REG(DSP2_MISC_BASE, DSP2_MISC_INT_CTRL, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Install dsp2 misc interrupt callback function
 *
 * @param  intType: DSP2 misc interrupt type
 * @param  cbFun: Pointer to interrupt callback function. The type should be void (*fn)(void)
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void DSP2_MISC_Int_Callback_Install(DSP2_MISC_INT_Type intType, intCallback_Type *cbFun)
{
    /* Check the parameters */
    CHECK_PARAM(IS_DSP2_MISC_INT_TYPE(intType));

    switch (intType) {
#if defined(CPU_D0)

        case DSP2_MISC_INT_AWB0:
            Interrupt_Handler_Register(DSP2_AWB0_IRQn, AWB0_IRQHandler);
            break;
#endif

        case DSP2_MISC_INT_AE:
            Interrupt_Handler_Register(DSP2_AE_IRQn, AE_IRQHandler);
            break;

        case DSP2_MISC_INT_WDR:
            Interrupt_Handler_Register(DSP2_WDR_IRQn, WDR_IRQHandler);
            break;

        case DSP2_MISC_INT_AWB1:
            Interrupt_Handler_Register(DSP2_AWB1_IRQn, AWB1_IRQHandler);
            break;

        case DSP2_MISC_INT_OSD_PB:
            Interrupt_Handler_Register(OSD_PB_IRQn, OSD_PB_IRQHandler);
            break;

        case DSP2_MISC_INT_SEOF0:
            Interrupt_Handler_Register(SEOF_INT0_IRQn, SEOF0_IRQHandler);
            break;

        case DSP2_MISC_INT_SEOF1:
            Interrupt_Handler_Register(SEOF_INT1_IRQn, SEOF1_IRQHandler);
            break;

        case DSP2_MISC_INT_SEOF2:
            Interrupt_Handler_Register(SEOF_INT2_IRQn, SEOF2_IRQHandler);
            break;

        case DSP2_MISC_INT_AE_HIST:
            Interrupt_Handler_Register(DSP2_AE_HIST_IRQn, AE_HIST_IRQHandler);
            break;

        case DSP2_MISC_INT_AWB2:
            Interrupt_Handler_Register(DSP2_AWB2_IRQn, AWB2_IRQHandler);
            break;

        case DSP2_MISC_INT_DISPLAY:
            Interrupt_Handler_Register(DISPLAY_IRQn, Display_IRQHandler);
            break;

        case DSP2_MISC_INT_SEOF3:
            Interrupt_Handler_Register(SEOF_INT3_IRQn, SEOF3_IRQHandler);
            break;

        default:
            break;
    }

    dsp2MiscIntCbfArra[intType] = cbFun;
}
#endif

/****************************************************************************/ /**
 * @brief  Select SEOF interrupt vsync source
 *
 * @param  intType: SEOF interrupt type
 * @param  source: SEOF interrupt vsync source type
 *
 * @return None
 *
*******************************************************************************/
void DSP2_MISC_SEOF_Set_Source(DSP2_MISC_INT_Type intType, DSP2_MISC_SEOF_Source_Type source)
{
    uint32_t tmpVal;

    /* Check the parameters */
    CHECK_PARAM(IS_DSP2_MISC_INT_TYPE(intType));
    CHECK_PARAM(IS_DSP2_MISC_SEOF_SOURCE_TYPE(source));

    tmpVal = BL_RD_REG(DSP2_MISC_BASE, DSP2_MISC_INT_CTRL);

    switch (intType) {
        case DSP2_MISC_INT_SEOF0:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MISC_RG_SEOF1_INT_SRC, source);
            break;

        case DSP2_MISC_INT_SEOF1:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MISC_RG_SEOF2_INT_SRC, source);
            break;

        case DSP2_MISC_INT_SEOF2:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MISC_RG_SEOF3_INT_SRC, source);
            break;

        case DSP2_MISC_INT_DISPLAY:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MISC_RG_DP_SEOF0_INT_SRC, source & 0x1);
            break;

        case DSP2_MISC_INT_SEOF3:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MISC_RG_SEOF4_INT_SRC, source);
            break;

        default:
            return;
            break;
    }

    BL_WR_REG(DSP2_MISC_BASE, DSP2_MISC_INT_CTRL, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Select SEOF interrupt vsync source
 *
 * @param  intType: SEOF interrupt type
 * @param  edge: SEOF interrupt edge type
 *
 * @return None
 *
*******************************************************************************/
void DSP2_MISC_SEOF_Set_Edge(DSP2_MISC_INT_Type intType, DSP2_MISC_SEOF_Edge_Type edge)
{
    uint32_t tmpVal;

    /* Check the parameters */
    CHECK_PARAM(IS_DSP2_MISC_INT_TYPE(intType));
    CHECK_PARAM(IS_DSP2_MISC_SEOF_SOURCE_TYPE(edge));

    tmpVal = BL_RD_REG(DSP2_MISC_BASE, DSP2_MISC_INT_CTRL);

    switch (intType) {
        case DSP2_MISC_INT_SEOF0:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MISC_RG_SEOF1_INT_EDGE, edge);
            break;

        case DSP2_MISC_INT_SEOF1:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MISC_RG_SEOF2_INT_EDGE, edge);
            break;

