RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_dsp2_misc.c
        case DSP2_MISC_INT_SEOF2:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MISC_RG_SEOF3_INT_EDGE, edge);
            break;

        case DSP2_MISC_INT_DISPLAY:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MISC_RG_DP_SEOF0_INT_EDGE, edge);
            break;

        case DSP2_MISC_INT_SEOF3:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MISC_RG_SEOF4_INT_EDGE, edge);
            break;

        default:
            return;
            break;
    }

    BL_WR_REG(DSP2_MISC_BASE, DSP2_MISC_INT_CTRL, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Reshape init
 *
 * @param  reshapeCfg: Reshape configuration structure pointer
 *
 * @return None
 *
*******************************************************************************/
void DSP2_MISC_Reshape_Init(DSP2_MISC_Reshape_Cfg_Type *reshapeCfg)
{
    uint32_t tmpVal;

    /* Check the parameters */
    CHECK_PARAM(IS_DSP2_MISC_ACTIVE_LEVEL_TYPE(reshapeCfg->hSyncLevel));
    CHECK_PARAM(IS_DSP2_MISC_ACTIVE_LEVEL_TYPE(reshapeCfg->vSyncLevel));

    tmpVal = BL_RD_REG(DSP2_MISC_BASE, DSP2_MISC_DVP_RESHAPE);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MISC_REG_RSHP_TGL_COUNT, reshapeCfg->vsyncNumber & 0x1f);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MISC_REG_RSHP_HSYNC_INV, reshapeCfg->hSyncLevel);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MISC_REG_RSHP_VSYNC_INV, reshapeCfg->vSyncLevel);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MISC_REG_RSHP_EN, reshapeCfg->enable);
    BL_WR_REG(DSP2_MISC_BASE, DSP2_MISC_DVP_RESHAPE, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Clear vsync toggle counter
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
void DSP2_MISC_Reshape_Counter_Clear(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(DSP2_MISC_BASE, DSP2_MISC_DVP_RESHAPE);
    BL_WR_REG(DSP2_MISC_BASE, DSP2_MISC_DVP_RESHAPE, BL_SET_REG_BIT(tmpVal, DSP2_MISC_REG_RSHP_CLR));
}

/****************************************************************************/ /**
 * @brief  Enable or disable use DE as hsync for DSP2
 *
 * @param  enable: Enable or disable
 *
 * @return None
 *
*******************************************************************************/
void DSP2_MISC_DE_As_Hsync(BL_Fun_Type enable)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(DSP2_MISC_BASE, DSP2_MISC_CONFIG);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MISC_CR_DSP2_DE_AS_HSYNC, enable);
    BL_WR_REG(DSP2_MISC_BASE, DSP2_MISC_CONFIG, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Select DVP TSRC data source
 *
 * @param  sourceType: DVP or CSI
 *
 * @return None
 *
*******************************************************************************/
void DSP2_MISC_TSRC_Source_Select(DSP2_MISC_TSRC_Source_Type sourceType)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(DSP2_MISC_BASE, DSP2_MISC_PIX_DATA_CTRL);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MISC_REG_DSP2_DTSRC_SRC, sourceType);
    BL_WR_REG(DSP2_MISC_BASE, DSP2_MISC_PIX_DATA_CTRL, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Configure bayer data shift function
 *
 * @param  bitEnable: Enable bits used
 * @param  shiftType: Set shift direction
 * @param  bitShift: Set Shift bits
 *
 * @return None
 *
*******************************************************************************/
void DSP2_MISC_Bayer_Shift(uint16_t bitEnable, DSP2_MISC_Bayer_Shift_Type shiftType, uint8_t bitShift)
{
    uint32_t tmpVal = 0;

    /* Check the parameters */
    CHECK_PARAM(IS_DSP2_MISC_BAYER_SHIFT_TYPE(shiftType));

    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MISC_REG_PIX_DATA_CTRL, bitEnable);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MISC_REG_PIX_DATA_SHT_BIT, bitShift);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MISC_REG_PIX_DATA_SHT_DIR, shiftType);
    BL_WR_REG(DSP2_MISC_BASE, DSP2_MISC_PIX_DATA_CTRL, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Reduce m frames to n frames function enable
 *
 * @param  m: Total frame count
 * @param  n: Enabled frame count
 * @param  step: Step between enabled frames
 *
 * @return None
 *
*******************************************************************************/
void DSP2_MISC_M2N_Enable(uint8_t m, uint8_t n, uint8_t step)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(DSP2_MISC_BASE, DSP2_MISC_DVP_FRAME_M_TO_N);
    tmpVal = BL_SET_REG_BIT(tmpVal, DSP2_MISC_CR_FRAME_M_TO_N_EN);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MISC_CR_FRAME_INTERVAL, step);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MISC_CR_FRAME_CNT_N, n);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, DSP2_MISC_CR_FRAME_CNT_M, m);
    BL_WR_REG(DSP2_MISC_BASE, DSP2_MISC_DVP_FRAME_M_TO_N, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Reduce m frames to n frames function disable
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
void DSP2_MISC_M2N_Disable(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(DSP2_MISC_BASE, DSP2_MISC_DVP_FRAME_M_TO_N);
    BL_WR_REG(DSP2_MISC_BASE, DSP2_MISC_DVP_FRAME_M_TO_N, BL_CLR_REG_BIT(tmpVal, DSP2_MISC_CR_FRAME_M_TO_N_EN));
}

/****************************************************************************/ /**
 * @brief  SEOF0 interrupt handler
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void SEOF0_IRQHandler(void)
{
    DSP2_MISC_Int_Clear(DSP2_MISC_INT_SEOF0);

    if (dsp2MiscIntCbfArra[DSP2_MISC_INT_SEOF0] != NULL) {
        dsp2MiscIntCbfArra[DSP2_MISC_INT_SEOF0]();
    }
}
#endif

/****************************************************************************/ /**
 * @brief  SEOF1 interrupt handler
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void SEOF1_IRQHandler(void)
{
    DSP2_MISC_Int_Clear(DSP2_MISC_INT_SEOF1);

    if (dsp2MiscIntCbfArra[DSP2_MISC_INT_SEOF1] != NULL) {
        dsp2MiscIntCbfArra[DSP2_MISC_INT_SEOF1]();
    }
}
#endif

/****************************************************************************/ /**
 * @brief  SEOF2 interrupt handler
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void SEOF2_IRQHandler(void)
{
    DSP2_MISC_Int_Clear(DSP2_MISC_INT_SEOF2);

    if (dsp2MiscIntCbfArra[DSP2_MISC_INT_SEOF2] != NULL) {
        dsp2MiscIntCbfArra[DSP2_MISC_INT_SEOF2]();
    }
}
#endif

/****************************************************************************/ /**
 * @brief  SEOF3 interrupt handler
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void SEOF3_IRQHandler(void)
{
    DSP2_MISC_Int_Clear(DSP2_MISC_INT_SEOF3);

    if (dsp2MiscIntCbfArra[DSP2_MISC_INT_SEOF3] != NULL) {
        dsp2MiscIntCbfArra[DSP2_MISC_INT_SEOF3]();
    }
}
#endif

/****************************************************************************/ /**
 * @brief  AWB0 interrupt handler
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void AWB0_IRQHandler(void)
{
    DSP2_MISC_Int_Clear(DSP2_MISC_INT_AWB0);

    if (dsp2MiscIntCbfArra[DSP2_MISC_INT_AWB0] != NULL) {
        dsp2MiscIntCbfArra[DSP2_MISC_INT_AWB0]();
    }
}
#endif

/****************************************************************************/ /**
 * @brief  AWB1 interrupt handler
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void AWB1_IRQHandler(void)
{
    DSP2_MISC_Int_Clear(DSP2_MISC_INT_AWB1);

