RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_dsp2_misc.c
    if (dsp2MiscIntCbfArra[DSP2_MISC_INT_AWB1] != NULL) {
        dsp2MiscIntCbfArra[DSP2_MISC_INT_AWB1]();
    }
}
#endif

/****************************************************************************/ /**
 * @brief  AWB2 interrupt handler
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void AWB2_IRQHandler(void)
{
    DSP2_MISC_Int_Clear(DSP2_MISC_INT_AWB2);

    if (dsp2MiscIntCbfArra[DSP2_MISC_INT_AWB2] != NULL) {
        dsp2MiscIntCbfArra[DSP2_MISC_INT_AWB2]();
    }
}
#endif

/****************************************************************************/ /**
 * @brief  AE interrupt handler
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void AE_IRQHandler(void)
{
    DSP2_MISC_Int_Clear(DSP2_MISC_INT_AE);

    if (dsp2MiscIntCbfArra[DSP2_MISC_INT_AE] != NULL) {
        dsp2MiscIntCbfArra[DSP2_MISC_INT_AE]();
    }
}
#endif

/****************************************************************************/ /**
 * @brief  AE HIST interrupt handler
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void AE_HIST_IRQHandler(void)
{
    DSP2_MISC_Int_Clear(DSP2_MISC_INT_AE_HIST);

    if (dsp2MiscIntCbfArra[DSP2_MISC_INT_AE_HIST] != NULL) {
        dsp2MiscIntCbfArra[DSP2_MISC_INT_AE_HIST]();
    }
}
#endif

/****************************************************************************/ /**
 * @brief  WDR interrupt handler
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void WDR_IRQHandler(void)
{
    DSP2_MISC_Int_Clear(DSP2_MISC_INT_WDR);

    if (dsp2MiscIntCbfArra[DSP2_MISC_INT_WDR] != NULL) {
        dsp2MiscIntCbfArra[DSP2_MISC_INT_WDR]();
    }
}
#endif

/****************************************************************************/ /**
 * @brief  OSD PB interrupt handler
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void OSD_PB_IRQHandler(void)
{
    DSP2_MISC_Int_Clear(DSP2_MISC_INT_OSD_PB);

    if (dsp2MiscIntCbfArra[DSP2_MISC_INT_OSD_PB] != NULL) {
        dsp2MiscIntCbfArra[DSP2_MISC_INT_OSD_PB]();
    }
}
#endif

/****************************************************************************/ /**
 * @brief  Display interrupt handler
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void Display_IRQHandler(void)
{
    DSP2_MISC_Int_Clear(DSP2_MISC_INT_DISPLAY);

    if (dsp2MiscIntCbfArra[DSP2_MISC_INT_DISPLAY] != NULL) {
        dsp2MiscIntCbfArra[DSP2_MISC_INT_DISPLAY]();
    }
}
#endif

/*@} end of group DSP2_MISC_Public_Functions */

/*@} end of group DSP2_MISC */

/*@} end of group BL808_Peripheral_Driver */
